FutureDesigns/uEZ/uEZ/Source/Platform/FDI/CARRIER_LPC1788/CARRIER_LPC1788.c
#if (DO_NOT_INCLUDE_LPC17XX40XX_CODE_READ_PROTECTION_1 == 1)
    // Create this define set to 1 in application code to allow for only setting CRP1 in a bootloader.
#else
UEZ_PUT_SECTION(".crp1", static const TUInt32 G_LPC17XX40XX_CRP1 = 0xFFFFFFFF);
TUInt32 *_crp1ptr = (TUInt32 * const)&G_LPC17XX40XX_CRP1;
#endif

/* On LPC1788 we want to keep the same tested AHB memory map even if 
 * MCI card or USB host isn't used. So create dummy memory in AHB for it.
 * It isn't a problem if Ethernet is turned off, so no array for it. */
#if (UEZ_ENABLE_USB_HOST_STACK != 1)
UEZ_PUT_SECTION(".usbhostmem", static TUInt8 G_usbHostMemory[8*1024]);
volatile TUInt8 *_usbMemoryptr = G_usbHostMemory;
#else // memory should already exist
#endif

// Currently we never made an expansion breakout for Carrier, but maybe we could.
#if (EXTERNAL_MCI_CARD == 1)    // mci memory should exist
#else // The below is equivalent to NUM_MAX_BLOCKS == 16 in LPC17xx_40xx_MCI.c.
UEZ_PUT_SECTION(".mcimem", static TUInt8 G_mciDummyMemory[16*136*4]);
volatile TUInt8 *_mciDummyMemoryptr = G_mciDummyMemory;
#endif

/*---------------------------------------------------------------------------*
 * Macros:
 *---------------------------------------------------------------------------*/

// Note that uEZBSP Delays are only accurate for around level 2 or medium optimization.
// With no optimization it will be about double the time. So we will always optimize them.
// For IAR application projects set the optimization level of this file to medium or high.
#if ( PROCESSOR_OSCILLATOR_FREQUENCY == 120000000)
//#elif ( PROCESSOR_OSCILLATOR_FREQUENCY == 72000000) // TODO not validated yet.
#else
    #error "1 microSecond delay not defined for CPU speed"
#endif

// Note: To use a non-default max MCU frequency, can redefine UEZBSPDelay1US here.
// UEZBSDelay functions are now weakly defined in library for default frequency.
#if 0 // example for slower clock version of delay function
UEZ_FUNC_OPT(UEZ_OPT_LEVEL_MED,
void UEZBSPDelay1US(void)
{
#if ( PROCESSOR_OSCILLATOR_FREQUENCY == 72000000) // TODO not validated yet.
    nops50();
    nops10();
    nop();
    nop();
    nop();
#else
    #error "1 microSecond delay not defined for CPU speed"
#endif
})
#endif

/*---------------------------------------------------------------------------*
 * Routine:  UEZBSPSDRAMInit
 *---------------------------------------------------------------------------*
 * Description:
 *      Initialize the external SDRAM.
 *---------------------------------------------------------------------------*/
void UEZBSP_RAMInit(void)
{   // 7 ns is slowest speed rating supported/used. Driver only supports CAS 2. Some numbers would change for CAS 3.
    static const T_LPC17xx_40xx_SDRAM_Configuration sdramConfig_IS45S32400F_7 = { 
            UEZBSP_SDRAM_BASE_ADDR,
            UEZBSP_SDRAM_SIZE,
            SDRAM_CAS_2, // only 2 supported, this number ignored
            SDRAM_RAS_2, // only 2 supported, this number ignored
            LPC17xx_40xx_SDRAM_CLKOUT0,
            SDRAM_CLOCK_FREQUENCY,
            64, // ms
            4096, // cycles
            SDRAM_CYCLES(20), // tRP precharge to activate period - All used parts 18/20, which is same cycle number
            SDRAM_CYCLES(45), // tRAS min // Used parts 42/45. Same register value up to 49
            SDRAM_CYCLES(70), // tXSR min // 67-83 = same cycles, no parts used < 67, no used parts list SREX
            SDRAM_CYCLES(20), // tAPR/tRCD Active Command to Read Command // 17-33 = same cycles, no parts used < 18
            SDRAM_CLOCKS(4),  // tDAL Input Dat to ACT/REF (tCK units) // On existing parts this stays the same as long as CAS 2 is used.
            SDRAM_CLOCKS(2), // tWR = write recovery time = tCK + 1(depends on rise time) // Used parts have less than 20 cycles, 2 tCK is worst case.
            SDRAM_CYCLES(65), // tRC Row Cycle Time or Command Period // 50-66 are same same number
            SDRAM_CYCLES(64), // Refresh Cycle Time tRFC/tREF  // 50-66 are same same number
            SDRAM_CYCLES(70), // tXSR Exit Self-Refresh Time // 67-83 = same cycles, no parts used < 67
            SDRAM_CYCLES(14), // tRRD Row active to Row Active (or command period) // no parts use > 17, so same register setting
            SDRAM_CLOCKS(2)}; // tMRD Mode Register Set (to command) (tCK units) // Some parts are 14, but 16/2CK is worst case
    LPC17xx_40xx_SDRAM_Init_32BitBus(&sdramConfig_IS45S32400F_7);

#if CONFIG_MEMORY_TEST_ON_SDRAM
    MemoryTest(UEZBSP_SDRAM_BASE_ADDR, UEZBSP_SDRAM_SIZE);
#endif
}

/*---------------------------------------------------------------------------*
 * Routine:  UEZBSP_ROMInit
 *---------------------------------------------------------------------------*
 * Description:
 *      Configure the NOR Flash
 *---------------------------------------------------------------------------*/
void UEZBSP_ROMInit(void)
{
  // Dummy code to keep various memory location declarations from optimizing out
#if (DO_NOT_INCLUDE_LPC17XX40XX_CODE_READ_PROTECTION_1 == 1)
#else
   _crp1ptr = _crp1ptr;
#endif
}

/*---------------------------------------------------------------------------*
 * Routine:  UEZBSP_PLLConfigure
 *---------------------------------------------------------------------------*
 * Description:
 *      Configure the PLL
 *---------------------------------------------------------------------------*/
void UEZBSP_PLLConfigure(void)
{
#if (PROCESSOR_OSCILLATOR_FREQUENCY == 72000000)
    const T_LPC17xx_40xx_PLL_Frequencies freq_CPU72MHz_Peripheral60Mhz_USB48MHz = {
            12000000,

            // Run PLL0 at 72 MHz
            PROCESSOR_OSCILLATOR_FREQUENCY,

            // Run PLL1 at 48 MHz
            48000000,

            // Use the main oscillator of 12 MHz as a source
            LPC17xx_40xx_CLKSRC_SELECT_MAIN_OSCILLATOR,

            // Use PLL0 for the CCLK, PCLK, and EMC Clk source (before dividers)
            LPC17xx_40xx_CPU_CLOCK_SELECT_PLL_CLK,

            // Use PPL1 (alt) for the USB
            LPC17xx_40xx_USB_CLOCK_SELECT_ALT_PLL_CLK,

            // CPU Clock is PLL0 / 1 or 72 MHz / 1 = 72 MHz
            1,

