FutureDesigns/uEZ/uEZ/Source/Platform/FDI/CARRIER_LPC1788/CARRIER_LPC1788.c
            // PCLK is PLL0 / 2, or 60 MHz
            1,

            // EMC runs at PLL0 / 2, or 60 MHz
            1,

            // USB Clock = PLL1 / 1 (48 MHz / 1)
            1,

            // CLKOUT is on the EMC CLK and at 60 MHz (60 MHz / 1)
            LPC17xx_40xx_CLOCK_OUT_SELECT_CPU,
            1,
            ETrue, };

    LPC17xx_40xx_PLL_SetFrequencies(&freq_CPU72MHz_Peripheral60Mhz_USB48MHz);

#else // 120000000 MHz

    const T_LPC17xx_40xx_PLL_Frequencies freq_CPU120MHz_Peripheral60Mhz_USB48MHz = {
            12000000,

            // Run PLL0 at 120 MHz
            PROCESSOR_OSCILLATOR_FREQUENCY,

            // Run PLL1 at 48 MHz
            48000000,

            // Use the main oscillator of 12 MHz as a source
            LPC17xx_40xx_CLKSRC_SELECT_MAIN_OSCILLATOR,

            // Use PLL0 for the CCLK, PCLK, and EMC Clk source (before dividers)
            LPC17xx_40xx_CPU_CLOCK_SELECT_PLL_CLK,

            // Use PPL1 (alt) for the USB
            LPC17xx_40xx_USB_CLOCK_SELECT_ALT_PLL_CLK,

            // CPU Clock is PLL0 / 1 or 120 MHz / 1 = 120 MHz
            1,

            // PCLK is PLL0 / 2, or 60 MHz
            2,

            // EMC runs at PLL0 / 2, or 60 MHz
            2,

            // USB Clock = PLL1 / 1 (48 MHz / 1)
            1,

            // CLKOUT is on the EMC CLK and at 60 MHz (60 MHz / 1)
            LPC17xx_40xx_CLOCK_OUT_SELECT_CPU,
            1,
            ETrue, };

    LPC17xx_40xx_PLL_SetFrequencies(&freq_CPU120MHz_Peripheral60Mhz_USB48MHz);

#endif
}

void UEZBSP_HEARTBEAT_TOGGLE(void)
{ // Per manual can read set register to determine the set state.
    if((LPC_GPIO4->SET & (1 << 23)) == (1 << 23)){ // if on
      LPC_GPIO4->CLR |= (1 << 23); // set off
    } else {
      LPC_GPIO4->SET |= (1 << 23); // set on
    }
}

void UEZBSP_CLEAR_RTOS_RAM(void)
{
#if (defined __GNUC__) // GCC
extern unsigned char __bss_start__[];
extern unsigned char __bss_end__[];
  // clear BSS so RTOS stuff is actualy 0.
//  memset((void *)".bss", 0x0,
  memset((void *)__bss_start__, 0x0,
   __bss_end__-__bss_start__);
#elif (defined __ICCARM__) || (defined __ICCRX__) // IAR
// TODO create new section for test variable that is outside kernel block
#pragma section = "__kernel_functions_block__"
//#pragma section = "_END"
// TODO test and verify on IAR
memset((void *)__section_begin("__kernel_functions_block__"), 0x0,
   __section_size("__kernel_functions_block__"));
#elif (defined __CC_ARM) // ARM RealView Compiler
#else
  #error "Early memory clear not implemented yet for this compiler."
#endif

}

/*---------------------------------------------------------------------------*
 * Routine:  UEZBSP_Pre_PLL_SystemInit
 *---------------------------------------------------------------------------*
 * Description:
 *      Earliest platform init function
 *      Can call before PLL comes on. For example to set LED initial state.
 *---------------------------------------------------------------------------*/
void UEZBSP_Pre_PLL_SystemInit(void) {
  // PIO4_23 initial state is pull up mode.
  // Turn off LED before init clocks. 
  // Then it will only start blinking after RTOS

  // Configure status led to be fully in our control
  // Make P4.23 be a GPIO pin
  LPC_GPIO4->PIN &= (uint32_t) ~(3 << 14);
  // and an output pin
  LPC_GPIO4->DIR |= (1 << 23);
  LPC_GPIO4->SET |= (1 << 23); // off
  
#if (CONFIG_LOW_LEVEL_TEST_CODE == 1)
    switch(G_hardwareTest.iTestMode){
    case HARDWARE_TEST_CRYSTAL:
    
    /*
    for(uint8_t i = 0; i < 10; i++){
      UEZBSP_HEARTBEAT_TOGGLE();
      UEZBSPDelayMS(100);
      UEZBSP_HEARTBEAT_TOGGLE();
      UEZBSPDelayMS(100);
     }*/

      UEZPlatform_INIT_LOW_LEVEL_UART_DEFAULT_CLOCK();
      COM_Send("\r\n\n", 3);
      COM_Send("CRYSTAL Mode\n", 13);
      COM_Send("Turning On Oscillators...\n", 26);
    break;
    case HARDWARE_TEST_SDRAM:
      UEZBSP_CLEAR_RTOS_RAM();
      UEZPlatform_INIT_LOW_LEVEL_UART_DEFAULT_CLOCK();
      COM_Send("\r\n\n", 3);
      COM_Send("SDRAM Mode\n", 11);
      COM_Send("Turning On Oscillators...\n", 26);
    break;
    case HARDWARE_TEST_I2C:
    

      UEZPlatform_INIT_LOW_LEVEL_UART_DEFAULT_CLOCK();
      COM_Send("\r\n\n", 3);
      COM_Send("I2C Mode\n", 9);
      COM_Send("Turning On Oscillators...\n", 26);
    break;
    case HARDWARE_TEST_AUDIO:
    

    break;
    case HARDWARE_TEST_NORMAL:
    default:
    
    break;
  }
#endif
}

/*---------------------------------------------------------------------------*
 * Routine:  UEZBSP_CPU_PinConfigInit
 *---------------------------------------------------------------------------*
 * Description:
 *      Immediately configure the port pins
 *      Called after PLL is working at rated speed
 *---------------------------------------------------------------------------*/
void UEZBSP_CPU_PinConfigInit(void)
{
    // Place any pin configuration that MUST be initially here (at power up
    // but before even SDRAM is initialized)
    // Can chage LED state here if troubleshooting SDRAM or want CLK OK signal 
#if (CONFIG_LOW_LEVEL_TEST_CODE == 1)
  switch(G_hardwareTest.iTestMode){
    case HARDWARE_TEST_CRYSTAL:    
      UEZPlatform_INIT_LOW_LEVEL_UART();
      COM_Send("Oscillators Enabled...\n", 23);
/*    for(uint8_t i = 0; i < 10; i++) {
      UEZBSP_HEARTBEAT_TOGGLE();
        UEZBSPDelayMS(100);
        
      UEZBSP_HEARTBEAT_TOGGLE();
        UEZBSPDelayMS(100);
      }*/
      // TODO output clock on a pin somewhere?
      // TODO try to measure clocks using timer to verify accuracy?
    
      COM_Send("...OK\n", 6);
    
    break;
    case HARDWARE_TEST_SDRAM:
      UEZPlatform_INIT_LOW_LEVEL_UART();
      COM_Send("Oscillators Enabled...\n", 23);
      COM_Send("Turning on SDRAM...\n", 20);

    // TODO print serial port that RAM test is about to begin
      //COM_Send("TEST BEGING\n", 12);
    
    break;
    case HARDWARE_TEST_I2C:
      UEZPlatform_INIT_LOW_LEVEL_UART();
      COM_Send("Oscillators Enabled...\n", 23);
      COM_Send("Turning on SDRAM...\n", 20);
    
    break;
    case HARDWARE_TEST_AUDIO:
    
    break;
    case HARDWARE_TEST_NORMAL:
    default:
    
    break;
  }
#endif
}

#if (defined __GNUC__) // GCC

#define RAMTEST_START_ADDRESS ((const uint32_t) __SDRAM_segment_start__) //&".frames")
#define RAMTEST_LENGTH (const uint32_t)(((uint32_t)UEZBSP_SDRAM_SIZE) - RAMTEST_START_ADDRESS)

#elif (defined __ICCARM__) || (defined __ICCRX__) // IAR
// Must declare these pragmas before below section placement if IAR
#define RAMTEST_START_ADDRESS UEZBSP_SDRAM_BASE_ADDR
#define RAMTEST_LENGTH (UEZBSP_SDRAM_SIZE-RAMTEST_START_ADDRESS)

#endif

/*---------------------------------------------------------------------------*
 * Routine:  UEZBSP_Post_SystemInit
 *---------------------------------------------------------------------------*
 * Description:
 *      Perform any tests before things such as zero mem are performed.
 *      Called after external RAM and ROM are setup. (end of SystemInit)
 *      Safe to access SDRAM here.
 *---------------------------------------------------------------------------*/
void UEZBSP_Post_SystemInit(void)
{
#if (CONFIG_LOW_LEVEL_TEST_CODE == 1)
  switch(G_hardwareTest.iTestMode){
    case HARDWARE_TEST_CRYSTAL:
    
    break;
    case HARDWARE_TEST_SDRAM:
      COM_Send("SDRAM RUNNING\n", 14);
      for(uint16_t i = 0; i < G_hardwareTest.iTestIterations; i++) {// perform RAM test X times    
        COM_Send("SDRAM TESTING...\n", 17);
        
        UEZBSP_HEARTBEAT_TOGGLE();
        MemoryTest(UEZBSP_SDRAM_BASE_ADDR, UEZBSP_SDRAM_SIZE);
        
        UEZBSP_HEARTBEAT_TOGGLE();
        COM_Send("SDRAM PASS\n", 11);
        UEZBSPDelayMS(100);
      }

    break;
    case HARDWARE_TEST_I2C:
    
    break;
    case HARDWARE_TEST_AUDIO:
    
    break;
    case HARDWARE_TEST_NORMAL:
    default:
    
    break;
  }
#endif

