FutureDesigns/uEZ/uEZ/Source/Platform/FDI/CARRIER_LPC1788/CARRIER_LPC1788.c
#if (UEZ_ENABLE_USB_HOST_STACK != 1)
  // Keep various memory location declarations from optimizing out
  _usbMemoryptr = _usbMemoryptr;
#else // memory should already exist
#endif

#if (EXTERNAL_MCI_CARD == 1) // mci memory should exist
#else // Keep various memory location declarations from optimizing out
    //_mciDummyMemoryptr = _mciDummyMemoryptr;
#endif
}

/*---------------------------------------------------------------------------*
 * Routine:  UEZBSP_InterruptsReset
 *---------------------------------------------------------------------------*
 * Description:
 *      Do the first initialization of the interrupts.
 *---------------------------------------------------------------------------*/
void UEZBSP_InterruptsReset(void)
{
    InterruptsReset();
#if (CONFIG_LOW_LEVEL_TEST_CODE == 1)
  switch(G_hardwareTest.iTestMode){
    case HARDWARE_TEST_CRYSTAL:
    
    break;
    case HARDWARE_TEST_SDRAM:
    
    break;
    case HARDWARE_TEST_I2C:
    
    break;
    case HARDWARE_TEST_AUDIO:
    
    break;
    case HARDWARE_TEST_NORMAL:
    default:
    
    break;
  }
#endif
}

/*---------------------------------------------------------------------------*
 * Routine:  uEZPlatformInit
 *---------------------------------------------------------------------------*
 * Description:
 *      Initialize the board with all the proper settings.
 *      Registers all peripherals specific to this board.
 *---------------------------------------------------------------------------*/
void uEZPlatformInit(void)
{
    // Do any initialiation necessary before the RTOS is started
#if (CONFIG_LOW_LEVEL_TEST_CODE == 1)
  switch(G_hardwareTest.iTestMode){
    case HARDWARE_TEST_CRYSTAL:
    
    break;
    case HARDWARE_TEST_SDRAM:
    
    break;
    case HARDWARE_TEST_I2C:
    
    break;
    case HARDWARE_TEST_AUDIO:
    
    break;
    case HARDWARE_TEST_NORMAL:
    default:
    
    break;
  }
#endif

#if (configGENERATE_RUN_TIME_STATS == 1)
    UEZPlatform_Timer1_Require();
#endif
}

#if (configGENERATE_RUN_TIME_STATS == 1)
T_uezDevice G_StatsTimer;
T_uezTimerCallback G_StatsTimerCallback;
volatile configRUN_TIME_COUNTER_TYPE G_RunTimeStatsCounter;

void RtosStatsTimerCallback(T_uezTimerCallback *aWorkspace)
{
   PARAM_NOT_USED(aWorkspace);
   G_RunTimeStatsCounter++;
}
 
configRUN_TIME_COUNTER_TYPE UEZBSP_GetGetRunTimeStatsCounter(void)
{
  return G_RunTimeStatsCounter;
}

T_uezError UEZBSP_ConfigureTimerForRunTimeStats(void)
{
  T_uezError error = UEZ_ERROR_HANDLE_INVALID;
  G_RunTimeStatsCounter = 0;
  if (UEZTimerOpen("Timer1", &G_StatsTimer) == UEZ_ERROR_NONE) {
    G_StatsTimerCallback.iTimer = G_StatsTimer;
    G_StatsTimerCallback.iMatchRegister = 1;
    G_StatsTimerCallback.iTriggerSem = UEZ_NULL_HANDLE;
    G_StatsTimerCallback.iCallback = RtosStatsTimerCallback;
    if (UEZTimerSetupRegularInterval(G_StatsTimer, 1,
            (PROCESSOR_OSCILLATOR_FREQUENCY) / (20*1000),
            &G_StatsTimerCallback) == UEZ_ERROR_NONE) {
      error = UEZTimerSetTimerMode(G_StatsTimer, TIMER_MODE_CLOCK);
      error = UEZTimerReset(G_StatsTimer);
      InterruptSetPriority(TIMER1_IRQn, INTERRUPT_PRIORITY_LOW);
      UEZTimerEnable(G_StatsTimer);
    } else { // an error occurred opening Timer
    }
  }
  return error;
}
#endif

/*---------------------------------------------------------------------------*
 * Routine:  UEZBSP_FatalError
 *---------------------------------------------------------------------------*
 * Description:
 *      A fatal error in uEZ will come here last.  We must turn off
 *      interrupts and put the platform in a halted state with a blinking
 *      LED.
 * Inputs:
 *      int32_t aErrorCode -- Blink the LED a number of times equal to
 *          the error code.
 *---------------------------------------------------------------------------*/
void UEZBSP_FatalError(int32_t aErrorCode)
{
    register TUInt32 i;
    register TUInt32 count;
    // Ensure interrupts are turned off
    portDISABLE_INTERRUPTS();

    // Configure status led to be fully in our control
    // Make P4.23 be a GPIO pin
    LPC_GPIO4->PIN &= (uint32_t) ~(3 << 14);
    // and an output pin
    LPC_GPIO4->DIR |= (1 << 23);

    // Blink our status led in a pattern, forever
    count = 0;
    while (1) {
        LPC_GPIO4->SET |= (1 << 23); // on
        for (i = 0; i < 15000000; i++)
            nop();
        //__nop();//asm ( "nop" );
        LPC_GPIO4->CLR |= (1 << 23); // off
        for (i = 0; i < 15000000; i++)
            nop();
        //__nop();//asm ( "nop" );
        count++;
        if (count >= (uint32_t) aErrorCode) {
            // Long pause
            for (i = 0; i < 80000000; i++)
                nop();
            //__nop();//asm ( "nop" );
            count = 0;
        }
    }
}

/*---------------------------------------------------------------------------*
 * Routine:  UEZPlatform_I2C0_Require
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the I2C0 device driver
 *---------------------------------------------------------------------------*/
void UEZPlatform_I2C0_Require(void)
{
    DEVICE_CREATE_ONCE();

    // Ensure the I2C0 exists in the HAL level
    LPC17xx_40xx_GPIO0_Require();
    LPC17xx_40xx_I2C0_Require(GPIO_P0_27, GPIO_P0_28);
    I2C_Generic_Create("I2C0", "I2C0", 0);
}

/*---------------------------------------------------------------------------*
 * Routine:  UEZPlatform_I2C1_Require
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the I2C1 device driver
 *---------------------------------------------------------------------------*/
void UEZPlatform_I2C1_Require(void)
{
    DEVICE_CREATE_ONCE();

    // Ensure the I2C1 exists in the HAL level
    LPC17xx_40xx_GPIO2_Require();
    LPC17xx_40xx_I2C1_Require(GPIO_P2_14, GPIO_P2_15);
    I2C_Generic_Create("I2C1", "I2C1", 0);
}

/*---------------------------------------------------------------------------*
 * Routine:  UEZPlatform_I2C2_Require
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the I2C2 device driver.  Usually only used when connecting
 *      to the external header.
 *---------------------------------------------------------------------------*/
void UEZPlatform_I2C2_Require(void)
{
    DEVICE_CREATE_ONCE();

    // Ensure the I2C2 exists in the HAL level
    LPC17xx_40xx_GPIO0_Require();
    LPC17xx_40xx_I2C2_Require(GPIO_P0_10, GPIO_P0_11);
    I2C_Generic_Create("I2C2", "I2C2", 0);
}

/*---------------------------------------------------------------------------*
 * Routine:  UEZPlatform_Temp0_Require
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the Temperature0 device driver.
 *---------------------------------------------------------------------------*/
void UEZPlatform_Temp0_Require(void)
{
    DEVICE_CREATE_ONCE();

    UEZPlatform_I2C0_Require();
    Temp_NXP_LM75A_Create("Temp0", "I2C0", 0x92 >> 1);
}

/*---------------------------------------------------------------------------*
 * Routine:  UEZPlatform_Accel0_Require
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the Accelerometer 0 device driver.
 *---------------------------------------------------------------------------*/
void UEZPlatform_Accel0_Require(void)
{
    DEVICE_CREATE_ONCE();

    UEZPlatform_I2C0_Require();
#if (FDI_PLATFORM == CARRIER_R4)
    Accelerometer_Freescale_MMA7455_I2C_Create("Accel0", "I2C0",
            MMA7455_I2C_ADDR);
#else
    Bosch_Accelerometer_BMA150_Create("Accel0", "I2C0");
#endif
}

/*---------------------------------------------------------------------------*
 * Routine:  UEZPlatform_GPDMAx_Require
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the General Purpose DMA drivers.
 *---------------------------------------------------------------------------*/
void UEZPlatform_GPDMA0_Require(void)
{
    DEVICE_CREATE_ONCE();

    LPC17xx_40xx_GPDMA0_Require();
    GPDMA_Generic_Create("GPDMA0", "GPDMA0");
}

void UEZPlatform_GPDMA1_Require(void)
{
    DEVICE_CREATE_ONCE();

    LPC17xx_40xx_GPDMA1_Require();
    GPDMA_Generic_Create("GPDMA1", "GPDMA1");
}

void UEZPlatform_GPDMA2_Require(void)
{
    DEVICE_CREATE_ONCE();

    LPC17xx_40xx_GPDMA2_Require();
    GPDMA_Generic_Create("GPDMA2", "GPDMA2");
}

void UEZPlatform_GPDMA3_Require(void)
{
    DEVICE_CREATE_ONCE();

    LPC17xx_40xx_GPDMA3_Require();
    GPDMA_Generic_Create("GPDMA3", "GPDMA3");
}

void UEZPlatform_GPDMA4_Require(void)
{
    DEVICE_CREATE_ONCE();

    LPC17xx_40xx_GPDMA4_Require();
    GPDMA_Generic_Create("GPDMA4", "GPDMA4");
}

void UEZPlatform_GPDMA5_Require(void)
{
    DEVICE_CREATE_ONCE();

    LPC17xx_40xx_GPDMA5_Require();
    GPDMA_Generic_Create("GPDMA5", "GPDMA5");
}

