FutureDesigns/uEZ/uEZ/Source/Platform/FDI/CARRIER_LPC1788/CARRIER_LPC1788.c
    LPC17xx_40xx_USBHost_PortA_Require(&portASettings);
    USBHost_Generic_Create("USBHost", "USBHost:PortA");
    // NOTE: USB1H_PWRD is on GPIO_P4_26 and is manually controlled
    // NOTE: USB1H_OVR  is on GPIO_P4_27 and is manually controlled
    LPC17xx_40xx_GPIO4_Require();
}

/* For now just use dummy functions so standard main.c routines will build,
 * but currently we don't have a port b host included on CARRIER board, but it 
 * should be possible to upgrade CARRIER to change mini-B to OTG port. */
TBool UEZPlatform_Host_Port_B_Detect()
{
    return ETrue; // return true that port b is device port
}

void UEZPlatform_USBHost_PortB_Require(void)
{
  
}

/*---------------------------------------------------------------------------*
 * Routine:  UEZPlatform_USBHost_Require
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the USB Host.
 *---------------------------------------------------------------------------*/
void UEZPlatform_USBHost_Require(void)
{
    UEZPlatform_USBHost_PortA_Require();
}

/*---------------------------------------------------------------------------*
 * Routine:  UEZPlatform_FileSystem_Require
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the File System using FATFS
 *---------------------------------------------------------------------------*/
void UEZPlatform_FileSystem_Require(void)
{
    T_uezDevice dev_fs;

    DEVICE_CREATE_ONCE();

    FileSystem_FATFS_Create("FATFS");
    UEZDeviceTableFind("FATFS", &dev_fs);
    UEZFileSystemInit();
    UEZFileSystemMount(dev_fs, "/");
}

/*---------------------------------------------------------------------------*
 * Routine:  UEZPlatform_MS0_Require
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the Mass Storage device MS0 using USBHost flash drive.
 *---------------------------------------------------------------------------*/
void UEZPlatform_MS0_Require(void)
{
    DEVICE_CREATE_ONCE();
    MassStorage_USB_Create("MS0", "USBHost");
}

/*---------------------------------------------------------------------------*
 * Routine:  UEZPlatform_MCI_DefaultFreq
 *---------------------------------------------------------------------------*
 * Description:
 *      Set the bootup max frequency for SD/MCI/SPI mode data transfer.
 *      Existing drivers will divide down till <= this frequency.
 *---------------------------------------------------------------------------*/
TUInt32 UEZPlatform_MCI_DefaultFreq(void)
{
  return 15000000UL;
}

/*---------------------------------------------------------------------------*
 * Routine:  UEZPlatform_MCI_TransferMode
 *---------------------------------------------------------------------------*
 * Description:
 *      For SD/MCI mode select 1-bit or 4-bit mode data transfer.
 *---------------------------------------------------------------------------*/
TUInt32 UEZPlatform_MCI_TransferMode(void)
{
  //return UEZ_MCI_BUS_1BIT_WIDE; // 1-bit mode
  return UEZ_MCI_BUS_4BIT_WIDE; // 4-bit mode
}

/*---------------------------------------------------------------------------*
 * Routine:  UEZPlatform_MS1_Require
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the Mass Storage device MS1 using SDCard drive.
 *---------------------------------------------------------------------------*/
void UEZPlatform_MS1_Require(void)
{
    DEVICE_CREATE_ONCE();

    UEZPlatform_SSP0_Require();
    LPC17xx_40xx_GPIO0_Require();
    // MICROSD_CSn = P0.16
    MassStorage_SDCard_Create("MS1", "SSP0", GPIO_P0_16);
}

/*---------------------------------------------------------------------------*
 * Routine:  UEZPlatform_USBFlash_Drive_Require
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the USB Flash drive using MS0 on the given drive number
 *---------------------------------------------------------------------------*/
void UEZPlatform_USBFlash_Drive_Require(TUInt8 aDriveNum)
{
    T_uezDevice ms0;
    T_uezDeviceWorkspace *p_ms0;

    DEVICE_CREATE_ONCE();

    // Now put the MS0 in the filesystem using the USB
    UEZPlatform_MS0_Require();
    UEZPlatform_FileSystem_Require();

    UEZDeviceTableFind("MS0", &ms0);
    UEZDeviceTableGetWorkspace(ms0, (T_uezDeviceWorkspace **)&p_ms0);
    FATFS_RegisterMassStorageDevice(aDriveNum, (DEVICE_MassStorage **)p_ms0);
}

/*---------------------------------------------------------------------------*
 * Routine:  UEZPlatform_SDCard_Drive_Require
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the SDCard drive using MS1 on the given drive number
 *---------------------------------------------------------------------------*/
void UEZPlatform_SDCard_Drive_Require(TUInt8 aDriveNum)
{
    T_uezDevice ms1;
    T_uezDeviceWorkspace *p_ms1;

    DEVICE_CREATE_ONCE();

    UEZPlatform_MS1_Require();
    UEZPlatform_FileSystem_Require();

    UEZDeviceTableFind("MS1", &ms1);
    UEZDeviceTableGetWorkspace(ms1, (T_uezDeviceWorkspace **)&p_ms1);
    FATFS_RegisterMassStorageDevice(aDriveNum, (DEVICE_MassStorage **)p_ms1);
}

/*---------------------------------------------------------------------------*
 * Routine:  UEZPlatform_AudioCodec_Require
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the Audio Codec driver and set the default level
 *---------------------------------------------------------------------------*/
#if UEZ_ENABLE_AUDIO_CODEC
void UEZPlatform_AudioCodec_Require(void)
{
    T_uezDevice p_ac;
    DEVICE_AudioCodec **ac;

    DEVICE_CREATE_ONCE();

    AudioCodec_WM8731_ADXL345_Create("AudioCodec0", "I2C0");
    UEZDeviceTableFind("AudioCodec0", &p_ac);
    UEZDeviceTableGetWorkspace(p_ac, (T_uezDeviceWorkspace **)&ac);

    (*ac)->UseConfiguration((void*)ac, 0);
}
#endif
/*---------------------------------------------------------------------------*
 * Routine:  UEZPlatform_AudioAmp_Require
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the Audio Amp driver and set the default level
 *---------------------------------------------------------------------------*/
#if UEZ_ENABLE_AUDIO_AMP
static T_uezDevice G_Amp;
static TUInt8 G_Amp_In_Use = AUDIO_AMP_NONE;
void UEZPlatform_AudioAmp_Require(void)
{    
    T_uezDevice I2C;
    T_uezError error;
    I2C_Request r;
    TUInt8 dataOut = 0x1C;

    DEVICE_CREATE_ONCE();

    // Detect which AMP
    UEZPlatform_I2C0_Require();
    UEZI2COpen("I2C0", &I2C);
    r.iAddr = 0x7C;
    r.iSpeed = 400; //kHz
    r.iWriteData = &dataOut;
    r.iWriteLength = 1; // send 1 byte
    r.iWriteTimeout = 100;
    r.iReadData = 0;
    r.iReadLength = 0; // read 0 bytes
    r.iReadTimeout = 0;

    error = UEZI2CTransaction(I2C, &r);

