FutureDesigns/uEZ/uEZ/Source/Platform/FDI/CARRIER_LPC1788/CARRIER_LPC1788.c
    if(!error) {
        AudioAmp_LM48110_Create("AMP0", "I2C0", 0x1F);
    } else {
      LPC17xx_40xx_GPIO2_Require();
      // P2.14 = VOL_UD
      // P2.15 = AMP_MODE
      AudioAmp_8551T_Create("AMP0", GPIO_P2_14, GPIO_P2_15, GPIO_NONE, 64);
    }

    UEZAudioAmpOpen("AMP0", &G_Amp);

    if(!error) {   
      // In case audio mixer not used set this to onboard speaker to prevent overdrive.
      UEZAudioAmpSetLevel(G_Amp, UEZ_DEFAULT_ONBOARD_SPEAKER_AUDIO_LEVEL_LM48110);
      G_Amp_In_Use = AUDIO_AMP_LM48110;
    } else {    
      // In case audio mixer not used set this to onboard speaker to prevent overdrive.
      UEZAudioAmpSetLevel(G_Amp, UEZ_DEFAULT_ONBOARD_SPEAKER_AUDIO_LEVEL_TDA8551);
      G_Amp_In_Use = AUDIO_AMP_TDA8551;
    }
}

static T_uezDevice G_Amp1;
void UEZPlatform_AudioAmp_1_Require(void)
{
    DEVICE_CREATE_ONCE();

    UEZPlatform_I2C0_Require();
    AudioAmp_WM8731_Create("AMP1", "I2C0", 0x7F);
    UEZAudioAmpOpen("AMP1", &G_Amp1);
    UEZAudioAmpSetLevel(G_Amp1, UEZ_DEFAULT_AUDIO_LEVEL);
    G_Amp_In_Use = AUDIO_AMP_WOLFSON;
}

/*---------------------------------------------------------------------------*
 * Routine:  CARRIER_1788_AudioMixerCallback
 *---------------------------------------------------------------------------*
 * Description:
 *
 *---------------------------------------------------------------------------*/
static T_uezError CARRIER_1788_AudioMixerCallback(
        T_uezAudioMixerOutput aChangedOutput,
            TBool aMute,
            TUInt8 aLevel)
{
    T_uezError error = UEZ_ERROR_NONE;

    switch(aChangedOutput){
        case  UEZ_AUDIO_MIXER_OUTPUT_ONBOARD_SPEAKER:
            if(G_Amp){
                if(aMute){
                    error = UEZAudioAmpMute(G_Amp);
                } else {
                    error = UEZAudioAmpUnMute(G_Amp);
                } 
                // This insures we scale the 0-255 input volume to the correct maximum volume for the onboard speaker.
                if(G_Amp_In_Use == AUDIO_AMP_TDA8551) { // enforce maximum volume based on AMP
                  aLevel = (aLevel * UEZ_DEFAULT_ONBOARD_SPEAKER_AUDIO_LEVEL_TDA8551 /255);
                } else if(G_Amp_In_Use == AUDIO_AMP_WOLFSON) {
                  aLevel = (aLevel * UEZ_DEFAULT_ONBOARD_SPEAKER_AUDIO_LEVEL /255);
                } else if(G_Amp_In_Use == AUDIO_AMP_LM48110) {
                  aLevel = (aLevel * UEZ_DEFAULT_ONBOARD_SPEAKER_AUDIO_LEVEL_LM48110 /255);
                } else {
                    aLevel = 0; // NEED TO DEFINE AMP AND MAX SAFE VOLUME LEVEL!
                }
                error = UEZAudioAmpSetLevel(G_Amp, aLevel);
            }
            break;
        // Example Offboard speaker callback case
        /*case  UEZ_AUDIO_MIXER_OUTPUT_OFFBOARD_SPEAKER:
            if(G_Amp){
                if(aMute){
                    error = UEZAudioAmpMute(G_Amp);
                } else {
                    error = UEZAudioAmpUnMute(G_Amp);
                }
                error = UEZAudioAmpSetLevel(G_Amp, aLevel);
            }
            break;*/
        case UEZ_AUDIO_MIXER_OUTPUT_ONBOARD_HEADPHONES:// TODO add and test volume scaling
            if (G_Amp1){
                if(aMute){
                    error = UEZAudioAmpMute(G_Amp1);
                } else {
                    error = UEZAudioAmpUnMute(G_Amp1);
                }
                error = UEZAudioAmpSetLevel(G_Amp1, aLevel);
            }
            break;
        default:
            break;
    }
    return error;
}

/*---------------------------------------------------------------------------*
 * Routine:  UEZPlatform_AudioMixer_Require
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the Audio Mixer driver and callback function
 *---------------------------------------------------------------------------*/
void UEZPlatform_AudioMixer_Require(void)
{
    DEVICE_CREATE_ONCE();

#if UEZ_ENABLE_AUDIO_AMP
    UEZPlatform_AudioAmp_Require();
    UEZPlatform_AudioAmp_1_Require();
    
    UEZAudioMixerMute(UEZ_AUDIO_MIXER_OUTPUT_MASTER); // mute here to avoid the "beep" sound from turning on too fast.

    // Set all 5 volume levels from platform file
    // First set master volume
    UEZAudioMixerSetLevel(UEZ_AUDIO_MIXER_OUTPUT_MASTER, UEZ_DEFAULT_AUDIO_LEVEL); // master volume
    
    UEZAudioMixerRegister(UEZ_AUDIO_MIXER_OUTPUT_ONBOARD_SPEAKER, &CARRIER_1788_AudioMixerCallback);
    // Next set onboard speaker based on AMP that is loaded. Callback will handle this automatically.
    UEZAudioMixerSetLevel(UEZ_AUDIO_MIXER_OUTPUT_ONBOARD_SPEAKER, UEZ_DEFAULT_AUDIO_LEVEL);
    //UEZAudioMixerUnmute(UEZ_AUDIO_MIXER_OUTPUT_ONBOARD_SPEAKER);

    UEZAudioMixerRegister(UEZ_AUDIO_MIXER_OUTPUT_ONBOARD_HEADPHONES, &CARRIER_1788_AudioMixerCallback);
    UEZAudioMixerSetLevel(UEZ_AUDIO_MIXER_OUTPUT_ONBOARD_HEADPHONES, UEZ_DEFAULT_AUDIO_LEVEL);
    //UEZAudioMixerUnmute(UEZ_AUDIO_MIXER_OUTPUT_ONBOARD_HEADPHONES);
        
    // Uncomment these lines to set the other 3 volumes if needed.
    //UEZAudioMixerSetLevel(UEZ_AUDIO_MIXER_OUTPUT_OFFBOARD_SPEAKER, UEZ_DEFAULT_OFFBOARD_SPEAKER_AUDIO_LEVEL); // We call this AFTER onboard speaker, so it will set the current volume.
    //UEZAudioMixerSetLevel(UEZ_AUDIO_MIXER_OUTPUT_ONBOARD_HEADPHONES, UEZ_DEFAULT_ONBOARD_HEADPHONES_AUDIO_LEVEL);
    //UEZAudioMixerSetLevel(UEZ_AUDIO_MIXER_OUTPUT_OFFBOARD_HEADPHONES, UEZ_DEFAULT_OFFBOARD_HEADPHONES_AUDIO_LEVEL);
    
#endif
}
#endif

/*---------------------------------------------------------------------------*
 * Routine:  UEZPlatform_CRC0_Require
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the CRC0 drivers for doing CRC calculations
 *---------------------------------------------------------------------------*/
void UEZPlatform_CRC0_Require(void)
{
    DEVICE_CREATE_ONCE();

