FutureDesigns/uEZ/uEZ/Source/Platform/FDI/CARRIER_LPC1788/CARRIER_LPC1788.c
    // Wired network needs an EMAC
    UEZPlatform_EMAC_Require();

    // Create the network driver for talking to lwIP on a wired
    // network.
#if (UEZ_ENABLE_TCPIP_STACK == 1)
    Network_lwIP_Create("WiredNetwork0");
#endif
}


#include <Source/Library/Network/GainSpan/CmdLib/GainSpan_CmdLib.h>
void UEZPlatform_WirelessNetwork0_Require(void)
{
    // These SPI pins work for both the Application Header and the PMOD Header
    // for GainSpan Modules with SPI configured.
    const T_GainSpan_Network_SPISettings spi_settings = {
    // SPI Settings
        "SSP0",// SSP Name
        1000000, // 1 MHz
        // Pins.
        GPIO_P2_10, // GPIO35 -- SPI CS
        GPIO_P1_5, // GPIO80_RTC_IRQ -- WIFI-IRQ
        GPIO_NONE, // iProgramMode not connected
        GPIO_NONE, // iSPIMode not connected
        GPIO_NONE, // iSRSTn not connected (only to RESET_OUT)
        };

    DEVICE_CREATE_ONCE();

    UEZPlatform_SSP0_Require();
    Network_GainSpan_Create("WirelessNetwork0", &spi_settings);
}

// Modify pins for Application Header before use
void UEZPlatform_WiFiProgramMode(TBool runMode)
{    
    if(runMode == ETrue) {
        printf("GainSpan Run Mode ...\n");        
    } else {
        printf("GainSpan Programming Mode ...\n");
    }
    RTOS_ENTER_CRITICAL()    ;
    
    UEZGPIOClear(GPIO_P1_5);        // WIFI_SRSTn
    UEZGPIOSetMux(GPIO_P1_5, 0);
    UEZGPIOOutput(GPIO_P1_5);       // WIFI_SRSTn
    
    UEZGPIOInput(GPIO_P2_11);       // WIFI IRQ

    if(runMode == ETrue) {
        UEZGPIOClear(GPIO_P1_6);        // WIFI RUN MODE
    } else {
        UEZGPIOSet(GPIO_P1_6);          // WIFI PROGRAM ON
    }
    UEZGPIOOutput(GPIO_P1_6);       
    
    UEZGPIOUnlock(GPIO_P0_2);       // 1788 TX
    UEZGPIOSetMux(GPIO_P0_2, 0);
    UEZGPIOOutput(GPIO_P0_2);

    UEZGPIOUnlock(GPIO_P0_3);       // 1788 RX
    UEZGPIOSetMux(GPIO_P0_3, 0);
    UEZGPIOInput(GPIO_P0_3);

    UEZGPIOUnlock(GPIO_P0_15);      // WIFI TX
    UEZGPIOSetMux(GPIO_P0_15, 0);
    UEZGPIOOutput(GPIO_P0_15);

    UEZGPIOUnlock(GPIO_P0_16);      // WIFI RX
    UEZGPIOSetMux(GPIO_P0_16, 0);
    UEZGPIOInput(GPIO_P0_16);

    //UEZTaskDelay(1000); // for debug
    UEZGPIOSet(GPIO_P1_5);          // WIFI_SRSTn

    CPUDisableInterrupts();
    while (1) {
        if (LPC_GPIO0->PIN & (1 << 3)) // 1788 RX = GPIO_P0_3
            LPC_GPIO0->SET = (1 << 15); // WIFI TX = GPIO_P0_15
        else
            LPC_GPIO0->CLR = (1 << 15);

        if (LPC_GPIO0->PIN & (1 << 16)) // WIFI RX = GPIO_P0_16
            LPC_GPIO0->SET = (1 << 2);  // 1788 TX = GPIO_P0_2
        else
            LPC_GPIO0->CLR = (1 << 2);  // 1788 TX = GPIO_P0_2
    }
}

/*---------------------------------------------------------------------------*
 * Routine:  UEZPlatform_I2S_Require
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the I2S drivers for talking to the expansion board.
 *---------------------------------------------------------------------------*/
#if UEZ_ENABLE_I2S_AUDIO
void UEZPlatform_I2S_Require(void)
{
    static const T_LPC17xx_40xx_I2S_Settings settings = {
            GPIO_P0_6,  // I2S_RX_SDA   = P0.6_I2SRX_SDA_SSEL1_MAT2.0
            GPIO_P0_4,  // I2S_RX_SCK   = P0.4_I2SRX_CLK_RD2_CAP2.0
            GPIO_P0_5,  // I2S_RX_WS    = P0.5_I2SRX_WS_TD2_CAP2.1
            GPIO_NONE,  // I2S_RX_MCLK  = not used

            GPIO_P0_9,  // I2S_TX_SDA   = P0.9_I2STX_SDA_MOSI1_MAT2.3
            GPIO_P0_7,  // I2S_TX_SCK   = P0.7_I2STX_CLK_SCK1_MAT2.1
            GPIO_P0_8,  // I2S_TX_WS    = P0.8_I2STX_WS_MISO1_MAT2.2
            GPIO_NONE,  // I2S_TX_MCLK  = not used
    };
    DEVICE_CREATE_ONCE();
    LPC17xx_40xx_I2S_Require(&settings);
    Generic_I2S_Create("I2S", "I2S");
}
#endif

/*---------------------------------------------------------------------------*
 * Routine:  UEZPlatform_ButtonBoard_Require
 *---------------------------------------------------------------------------*/
/**
 *  Setup the I2C GPIO drivers for talking to the button board
 */
/*---------------------------------------------------------------------------*/
void UEZPlatform_ButtonBoard_Require(void)
{
    static const T_GPIOKeypadAssignment keyAssignment[] = {
        { 0, KEY_ENTER },
        { 1, KEY_ARROW_LEFT },
        { 2, KEY_ARROW_RIGHT },
        { 3, KEY_ARROW_DOWN },
        { 4, KEY_ARROW_UP },
        { 0, 0 },
    };

    DEVICE_CREATE_ONCE();
    UEZPlatform_I2C0_Require();
    GPIO_PCF8574T_Create("GPIO:PCF8574T", UEZ_GPIO_PORT_EXT1, "I2C0", 0x48>>1);
    Keypad_Generic_GPIO_Create("BBKeypad", UEZ_GPIO_PORT_EXT1, keyAssignment, 5,
        KEYPAD_LOW_TRUE_SIGNALS, 
        UEZ_GPIO_PORT_PIN(UEZ_GPIO_PORT_EXT1, 7), 
        UEZ_GPIO_PORT_PIN(UEZ_GPIO_PORT_EXT1, 6));
}

/*---------------------------------------------------------------------------*
 * Routine:  UEZPlatform_System_Reset
 *---------------------------------------------------------------------------*
 * Description:
 *      Do a board specific system reset. In some cases we have a pin that
 *      can trigger POR as if you pushed a physical reset button.
 *      This is necessary to insure a full hardware reset across all lines
 *      with minimum reset hold timing.
 *---------------------------------------------------------------------------*/
void UEZPlatform_System_Reset(void) {
  // No HW reset on board
    NVIC_SystemReset();
}

/*---------------------------------------------------------------------------*
 * Routine:
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the I2C GPIO Buttons
 *---------------------------------------------------------------------------*/
void UEZPlatform_Button_Require(void)
{
    T_uezDeviceWorkspace *p_button0;
    T_uezDevice i2c0;
    T_uezDeviceWorkspace *p_i2c0;

    DEVICE_CREATE_ONCE();

