FutureDesigns/uEZ/uEZ/Source/Platform/FDI/CARRIER_LPC1788/CARRIER_LPC1788.c
    UEZDeviceTableFind("I2C0", &i2c0);
    UEZDeviceTableGetWorkspace(i2c0, (T_uezDeviceWorkspace **)&p_i2c0);

    UEZDeviceTableRegister(
        "ButtonBank0",
        (T_uezDeviceInterface *)&ButtonBank_NXP_PCA9551_Interface,
        0,
        &p_button0);
    ButtonBank_NXP_PCA9551_Configure(p_button0, (DEVICE_I2C_BUS **)p_i2c0, 0xC0>>1);
}

/*---------------------------------------------------------------------------*
 * Routine:
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the I2C GPIO LEDs
 *---------------------------------------------------------------------------*/
void UEZPlatform_LED_Require(void)
{
    T_uezDeviceWorkspace *p_led0;
    T_uezDevice i2c0;
    T_uezDeviceWorkspace *p_i2c0;

    DEVICE_CREATE_ONCE();

    UEZDeviceTableFind("I2C0", &i2c0);
    UEZDeviceTableGetWorkspace(i2c0, (T_uezDeviceWorkspace **)&p_i2c0);

    UEZDeviceTableRegister(
        "LEDBank0",
        (T_uezDeviceInterface *)&LEDBank_NXP_PCA9551_Interface,
        0,
        &p_led0);
    LED_NXP_PCA9551_Configure(p_led0, (DEVICE_I2C_BUS **)p_i2c0, 0xC0>>1);
}

// Don't enable console anymore in minimal requires, so that we can use this for GUI only bootloader, etc.
void UEZPlatform_Minimal_Require(void)
{
    LPC17xx_40xx_GPIO0_Require();
    LPC17xx_40xx_GPIO1_Require();
    LPC17xx_40xx_GPIO2_Require();
    LPC17xx_40xx_GPIO3_Require();
    LPC17xx_40xx_GPIO4_Require();
    LPC17xx_40xx_GPIO5_Require();
    UEZPlatform_CRC0_Require();
}

void UEZPlatform_Standard_Require(void)
{
    UEZPlatform_Minimal_Require();

    // Setup console immediately
    UEZPlatform_Console_Expansion_Require(UEZ_CONSOLE_WRITE_BUFFER_SIZE,
            UEZ_CONSOLE_READ_BUFFER_SIZE);
    UEZPlatform_LCD_Require();

    UEZPlatform_I2C0_Require();
    UEZPlatform_Temp0_Require();
    UEZPlatform_GPDMA0_Require();
    UEZPlatform_GPDMA1_Require();
    UEZPlatform_SSP0_Require();
    UEZPlatform_ADC0_0_Require();
    UEZPlatform_ADC0_1_Require();

    UEZPlatform_Flash0_Require();
    UEZPlatform_EEPROM0_Require();
    UEZPlatform_SDCard_Drive_Require(1);
	
#if UEZ_ENABLE_AUDIO_AMP
    UEZPlatform_AudioAmp_Require();
    UEZPlatform_AudioMixer_Require();
#endif
    UEZPlatform_Speaker_Require();

#if UEZ_ENABLE_AUDIO_CODEC
    UEZPlatform_AudioCodec_Require();
#endif

    UEZPlatform_Accel0_Require();
    UEZPlatform_RTC_Require();
    UEZPlatform_Touchscreen_Require();
    //UEZPlatform_TouchscreenPCAP_Require();
    UEZPlatform_Button_Require();
    UEZPlatform_LED_Require();
}

void UEZPlatform_Full_Require(void)
{
    // Setup console immediately
    UEZPlatform_Console_Expansion_Require(UEZ_CONSOLE_WRITE_BUFFER_SIZE,
            UEZ_CONSOLE_READ_BUFFER_SIZE);
    UEZPlatform_LCD_Require();

    LPC17xx_40xx_GPIO0_Require();
    LPC17xx_40xx_GPIO1_Require();
    LPC17xx_40xx_GPIO2_Require();
    LPC17xx_40xx_GPIO3_Require();
    LPC17xx_40xx_GPIO4_Require();
    LPC17xx_40xx_GPIO5_Require();

    UEZPlatform_CRC0_Require();
    UEZPlatform_I2C0_Require();
    UEZPlatform_I2C2_Require();
    UEZPlatform_Temp0_Require();
    UEZPlatform_GPDMA0_Require();
    UEZPlatform_GPDMA1_Require();
    UEZPlatform_GPDMA2_Require();
    UEZPlatform_GPDMA3_Require();
    UEZPlatform_GPDMA4_Require();
    UEZPlatform_GPDMA5_Require();
    UEZPlatform_GPDMA6_Require();
    UEZPlatform_GPDMA7_Require();
    UEZPlatform_Timer0_Require();
    UEZPlatform_Timer1_Require();
    UEZPlatform_Timer2_Require();
    UEZPlatform_Timer3_Require();
    UEZPlatform_SSP0_Require();
    UEZPlatform_ADC0_0_Require();
    UEZPlatform_ADC0_1_Require();
    UEZPlatform_ADC0_2_Require();
    UEZPlatform_Flash0_Require();
    UEZPlatform_EEPROM0_Require();
    UEZPlatform_USBHost_Require();
    UEZPlatform_USBFlash_Drive_Require(0);
    UEZPlatform_Watchdog_Require();
    UEZPlatform_SDCard_Drive_Require(1);
    UEZPlatform_USBDevice_Require();
    UEZPlatform_WiredNetwork0_Require();
    
    // Init audio outputs before amp so amp doesn't get noise/undefined signal.
    UEZPlatform_Speaker_Require(); // PWM output for basic tones
    UEZPlatform_DAC0_Require();    // DAC output
    
#if UEZ_ENABLE_AUDIO_AMP
    UEZPlatform_AudioAmp_Require();
#endif

#if UEZ_ENABLE_AUDIO_CODEC
    UEZPlatform_AudioCodec_Require();
#endif
    
    UEZPlatform_AudioMixer_Require(); // UEZPlatform_AudioAmp_Require();
    UEZAudioMixerMute(UEZ_AUDIO_MIXER_OUTPUT_MASTER);
    //UEZAudioMixerUnmute(UEZ_AUDIO_MIXER_OUTPUT_MASTER);

    UEZPlatform_Accel0_Require();
    UEZPlatform_RTC_Require();
    UEZPlatform_Touchscreen_Require();
    //UEZPlatform_TouchscreenPCAP_Require();
    UEZPlatform_Button_Require();
    UEZPlatform_LED_Require();
}

TUInt16 UEZPlatform_LCDGetHeight(void)
{
    return UEZ_LCD_DISPLAY_HEIGHT;
}
TUInt16 UEZPlatform_LCDGetWidth(void)
{
    return UEZ_LCD_DISPLAY_WIDTH;
}

//#include <Source/Library/GUI/FDI/SimpleUI/SimpleUI_Types.h>
TUInt32 UEZPlatform_GetBaseAddress(void)
{
    // Keep various memory location declarations from optimizing out
    ((TUInt8 volatile *)_framesMemoryptr)[0] = _framesMemoryptr[0];
    return LCD_DISPLAY_BASE_ADDRESS;
}

TUInt32 UEZPlatform_LCDGetFrame(TUInt16 aFrameNum)
{
    return (TUInt32)FRAME(aFrameNum);
}
TUInt32 UEZPlatform_LCDGetFrameBuffer(void)
{
    return (TUInt32)LCD_FRAME_BUFFER;
}
TUInt32 UEZPlatform_LCDGetFrameSize(void)
{
    return FRAME_SIZE;
}
TUInt32 UEZPlatform_SerialGetDefaultBaud(void)
{
    return SERIAL_PORTS_DEFAULT_BAUD;
}
TUInt32 UEZPlatform_ProcessorGetFrequency(void)
{
    return PROCESSOR_OSCILLATOR_FREQUENCY;
}
TUInt32 UEZPlatform_GetPCLKFrequency(void)
{
#if (PROCESSOR_OSCILLATOR_FREQUENCY == 72000000)
    return 72000000;
#else
    return 60000000;
#endif
}

#if (defined __GNUC__) // GCC
extern uint32_t  __RAM_segment_end__[];
extern uint32_t  __SRAM_segment_end__[];
extern uint32_t  __SDRAM_segment_end__[];
extern uint32_t  __SDRAM_segment_size__[];
extern uint8_t  __heap_start__[];
// our custom named sections
extern uint32_t  SDRAM_END[];
extern uint32_t  SRAM1_END[];

#elif (defined __ICCARM__) || (defined __ICCRX__) // IAR
// Must declare these pragmas if IAR
#pragma section = "__RAM_segment_end__"
#pragma section = "SRAM1_end"
#pragma section = "SDRAM_end__"
//#pragma section = "SDRAM_END"
//#pragma section = "SRAM1_END"

