FutureDesigns/uEZ/uEZ/Source/Platform/FDI/CARRIER_LPC1788/CARRIER_LPC1788.c
#pragma section=".heap"
#pragma section="HEAP"
void * __heap_start__ = __section_begin(".heap");
void * heap_end_address = __section_end("HEAP");

#else
  #error "Not supported for this compiler."
#endif

// FreeRTOS will take care of aligment of both start and end addresses.
TUInt32 UEZPlatform_GetApplicationHeapSize(void) // for heap 2, 4
{ 
    return (uint32_t) // original -> // return __HEAP_SIZE__; 
#if (HEAP_ENABLED_ON_EXTERNAL_RAM == 1)
  #if (defined __GNUC__) // GCC
                     SDRAM_END
  #elif (defined __ICCARM__) || (defined __ICCRX__) // IAR
                      heap_end_address - 1
  #endif
#else // internal RAM heap only
  #if (defined __GNUC__) // GCC
                    SRAM1_END
  #elif (defined __ICCARM__) || (defined __ICCRX__) // IAR
                      heap_end_address - 1
  #endif
#endif
                    - (uint32_t) __heap_start__; 
}

#if (INCLUDE_EMWIN == 1)
#include <Source/Library/GUI/SEGGER/emWin/LCD.h>
#include <Source/Library/GUI/SEGGER/emWin/GUIDRV_Lin.h>
const void* UEZPlatform_GUIColorConversion(void)
{
    return GUICC_M555;
}

const void *UEZPlatform_GUIDisplayDriver()
{
    return &GUIDRV_Lin_16_API;
}
#else
const void* UEZPlatform_GUIColorConversion(void)
{
    return 0;
}

const void *UEZPlatform_GUIDisplayDriver()
{
    return 0;
}
#endif

void *SUICallbackGetLCDBase(void)
{
    return (void *)(LPC_LCD->UPBASE);
}
void SUICallbackSetLCDBase(void *aAddress)
{
    LPC_LCD->UPBASE = (TUInt32)aAddress;
}

TUInt32 UEZPlatform_5V_Monitor_Get_Raw_Reading(void)
{    
    T_uezDevice adc;
    T_uezError error;
    ADC_RequestSingle r;
    TUInt32 reading = 0; // on any failure just return 0.
    // 0 isn't valid as we should have some voltage on a running unit, even on bad 5V rail.
     
    error = UEZADCOpen("ADC0", &adc);
    if (error == UEZ_ERROR_NONE) { // Take a reading
        r.iADCChannel = 2;
        r.iBitSampleSize = 10;
        r.iTrigger = ADC_TRIGGER_NOW;
        r.iCapturedData = &reading;
        error = UEZADCRequestSingle(adc, &r);
        if (error == UEZ_ERROR_NONE) {
            // Generate percentage based on perfect 5V input
            // divided by 2, but compared to a A/D value of 0 - 0x3FFF
            // with a reference voltage of 3.3V
            //   reading = (voltage / 5 V) * 0x3FF
            //   percent = 100 * (reading / (0x3FF * 3.3V/5V))
            //percent = reading * 100 / 0x307;
        }
    }
    UEZADCClose(adc);
    return reading;
}

T_pixelColor SUICallbackRGBConvert(int32_t r, int32_t g, int32_t b)
{
    return RGB(r, g, b);
}

void WriteByteInFrameBufferWithAlpha(UNS_32 aAddr, COLOR_T aPixel, T_swimAlpha aAlpha)
{
    static COLOR_T mask = (COLOR_T)(~((1<<10)|(1<<5)|(1<<0)));
    COLOR_T *p = (COLOR_T *)aAddr;

    switch (aAlpha) {
        case SWIM_ALPHA_50:
            *p = (((*p & mask)>>1) + ((aPixel & mask)>>1));
            break;
    }
}

/*---------------------------------------------------------------------------*
 * Routine:  vMainMPUFaultHandler
 *---------------------------------------------------------------------------*/
/**
 *  Determine which stack was in use when the MPU fault occurred and extract
    the stacked PC. 
 *
 *  @return         int32_t
 */
/*---------------------------------------------------------------------------*/
void vMainMPUFaultHandler( unsigned long * pulFaultRegisters ) {
    PARAM_NOT_USED(pulFaultRegisters);
    unsigned long ulStacked_pc = 0UL;
    ( void ) ulStacked_pc;
    // Determine which stack was in use when the MPU fault occurred and extract the stacked PC.

    __asm volatile
    (
        "   tst lr, #4          \n"
        "   ite eq              \n"
        "   mrseq r0, msp       \n" /* The code that generated the exception was using the main stack. */
        "   mrsne r0, psp       \n" /* The code that generated the exception was using the process stack. */
        "   ldr r0, [r0, #24]   \n" /* Extract the value of the stacked PC. */
        "   str r0, [sp]        \n" /* Store the value of the stacked PC into ulStacked_pc. */
    );

    for( ;; ); // Inspect ulStacked_pc to locate the offending instruction.
    //UEZPlatform_System_Reset();
}

/*---------------------------------------------------------------------------*
 * Routine:  main
 *---------------------------------------------------------------------------*/
/**
 *  The main() routine in UEZ is only a stub that is used to start
 *      the whole UEZ system.  UEZBSP_Startup() is immediately called.
 *
 *  @return         int32_t
 */
/*---------------------------------------------------------------------------*/
int32_t main(void)
{
    UEZBSP_Startup();
    while (1) {
    } // never should get here
}
/** @} */
/*-------------------------------------------------------------------------*
 * End of File:  uEZPlatform.c
 *-------------------------------------------------------------------------*/

